{
  "title": "Experience",
  "summary": "Throughout my professional journey, I've had the invaluable opportunity to collaborate with multidisciplinary and international teams across various companies. This global exposure has been instrumental in my continuous growth and professional development, significantly broadening my perspective and skill set.",
  "jobs": [
    {
      "id": "0",
      "company": "S.P.C",
      "dates": "Mar 2013 - Dec 2016",
      "title": "Jr/Mid Developer",
      "highlights": [
        {
          "title": "Web Application Support & Development",
          "description": "Provided essential support for a web application built with ASP.NET, C# (LINQ), and Code First, ensuring its stability and functionality."
        },
        {
          "title": "Full-Stack Contribution & Design",
          "description": "Actively contributed to the design and implementation of complete web applications using ASP.NET and Silverlight."
        },
        {
          "title": "Diverse Application Development",
          "description": "Expanded expertise beyond web to include desktop application development with WPF, showcasing versatility across different platforms."
        },
        {
          "title": "Rapid Career Progression",
          "description": "Quickly advanced from Junior to Intermediate Programmer, demonstrating a strong aptitude for learning and taking on increased responsibility."
        }
      ]
    },
    {
      "id": "1",
      "company": "PK Global",
      "dates": "Jan 2017 - Aug 2021",
      "title": "Software Engineer",
      "highlights": [
        {
          "title": "Full-Cycle Project Delivery",
          "description": "Successfully delivered over four medium-sized projects as an Intermediate Angular/.NET Developer, focusing on new feature development and critical bug resolution within SCRUM methodologies."
        },
        {
          "title": "Rapid Professional Advancement",
          "description": "Progressed from an Intermediate Developer to Lead Software Engineer on a complex, cross-platform project, demonstrating accelerated growth and increasing responsibility."
        },
        {
          "title": "Cross-Platform Expertise",
          "description": "Mastered and applied diverse technologies including Angular, Node.js (with Sails.js), and PostgreSQL to lead and develop sophisticated multi-platform solutions."
        },
        {
          "title": "Agile Methodologies & Problem-Solving",
          "description": "Actively collaborated in an agile environment (SCRUM) to identify, analyze, and implement solutions for complex technical challenges."
        }
      ]
    },
    {
      "id": "2",
      "company": "Unosquare",
      "dates": "Aug 2021 - Now",
      "title": "Tech Lead / Software Engineer",
      "highlights": [
        {
          "title": "Team Leadership & Project Management",
          "description": "Leading and coordinating development teams, overseeing resource allocation, and streamlining the code delivery process for large-scale projects."
        },
        {
          "title": "Full-Stack Development",
          "description": "Driving the creation of robust web solutions, encompassing both front-end development in Angular and back-end services with C# and .NET Core."
        },
        {
          "title": "Technical Analysis & Design",
          "description": "Translating business needs into technical specifications through requirements analysis, feature design, and implementation planning."
        },
        {
          "title": "Quality Assurance & Collaboration",
          "description": "Ensuring code quality and fostering team growth through comprehensive code reviews, peer programming, and efficient bug resolution."
        }
      ]
    }
  ]
}
